[
    {
        "title": "Long Blog First Person",
        "content": [
            {
                "section": "About Me",
                "text": "I’m Bleddyn Edwards, founder of be – training and coaching, based in Wales, UK. I work as a personal trainer and coach, supporting people to build strength, confidence and sustainable fitness through clear, personalised coaching. My aim is to help people feel more capable in their bodies and better equipped to meet both everyday demands and more ambitious physical goals. My approach to coaching has been shaped as much by my professional background as by my training in fitness. Before retraining as a personal trainer, I spent over 30 years working in the communications and creative industries, holding senior roles that involved managing people, projects and long-term client relationships. That experience gave me a deep understanding of motivation, behaviour change and the realities of balancing work, life and wellbeing — insight that strongly informs how I work with clients today. I place a high value on empathy, clear communication and realistic planning, recognising that progress is rarely just physical. Alongside my professional qualifications, I bring extensive personal experience of training for and taking part in endurance and adventure events. I’ve competed in triathlons ranging from sprint distance through to middle-distance races, including Ironman 70.3 Mallorca and the Cotswold 113. My running experience includes road and trail races, half marathons in the UK and overseas, and more extreme challenges such as the Greenland Arctic Marathon. I’ve also taken part in swim-run events, multi-day cycle touring across Scotland and Wales, ski touring in France and Austria, and a number of mountain ascents, including Mount Toubkal in Morocco and the Welsh Three Peaks. Having trained for these challenges myself, I understand what it takes — physically and mentally — to prepare for demanding goals. I know the importance of consistency, patience and adaptability, as well as how setbacks and competing priorities can affect progress. This lived experience allows me to coach with both authority and empathy. Through be – training and coaching, my intention is to provide coaching that is supportive yet purposeful, structured yet flexible, and always grounded in sustainable progress. For me, fitness isn’t about chasing perfection or comparison. It’s about becoming stronger, more confident and more capable — and learning how to train in a way that supports you for the long term."
            },
            {
                "section": "Short First Person intro",
                "text": "’m Bleddyn, founder of be – training and coaching, based in Wales, UK. I help people build strength,confidence and sustainable fitness through clear, personalised coaching — providing both structureand accountability to support long-term progress. My approach is shaped by lived experience and along career working with people, not just programmes and plans."
            },
            {
                "section": "Short Third Person intro",
                "text": "Bleddyn Edwards is the founder of be – training and coaching, based in Wales, UK. He is a personaltrainer and coach who works with people looking to build strength, confidence and sustainable fitnessthrough clear, personalised coaching.Before retraining as a coach, Bleddyn spent over 30 years in the communications and creativeindustries, managing people, projects and long-term client relationships. This experience shapes hisapproach to coaching today — bringing structure, empathy and an understanding of how real lives,work pressures and motivation intersect with health and fitness.Alongside his professional training, Bleddyn has extensive personal experience preparing forendurance and adventure events, including triathlons, running races, swim-run events, cycle touring,ski touring and mountain ascents. He understands first-hand what it takes to train for challenginggoals and supports clients with practical, realistic guidance grounded in lived experience."
            },
            {
                "section": "Value based paragraph",
                "text": "At be – training and coaching, the focus is on progress that is purposeful, sustainable and personal.Coaching is built around empathy, clear communication and mutual trust — recognising thateveryone starts from a different place and brings different challenges with them. The aim is notperfection or quick fixes, but consistent improvement, growing confidence and a stronger connectionbetween effort and outcome. Training plans are thoughtful and adaptable, designed to support bothphysical development and long-term motivation, helping clients feel more capable in their bodies andmore confident in their ability to take on challenges."
            },
            {
                "section": "How I coach",
                "text": "My coaching is built around the belief that progress comes from understanding the person, not justprescribing exercise. Everyone brings a different background, set of pressures and relationship withfitness, and I take time to listen before setting direction. Empathy, clarity and trust sit at the heart ofhow I work, allowing coaching to be supportive without losing purpose.Structure and accountability are central to my approach. Training plans provide direction, but it’s theongoing support, regular check-ins and shared commitment that help clients stay consistent overtime. I aim to be a steady presence — someone clients can rely on to keep them focused,encouraged and moving forward, even when motivation dips or life gets in the way.I use progressive planning to build confidence and momentum, while remaining flexible enough toadapt when circumstances change. Whether a client is working towards an event or simply aiming tofeel fitter and stronger day to day, the focus is always on realistic goal-setting, consistency andsustainable improvement rather than extremes or quick fixes.Having trained for a wide range of endurance and adventure challenges myself, I understand boththe physical demands of preparation and the mental resilience required to stay committed. This livedexperience shapes how I support clients through setbacks, plateaus and competing priorities —helping them adjust their approach without losing sight of the bigger picture. Above all, my role as a coach is to provide guidance, accountability and encouragement that helpclients develop confidence in their ability to train with intent and independence. The aim isn’t justshort-term results, but long-term capability, understanding and self-belief."
            }
           
        ]
    }
]